skyward-er/miosix-kernel/miosix/arch/common/drivers/stm32f2_f4_serial.cpp
/***************************************************************************
 *   Copyright (C) 2010-2018 by Terraneo Federico                          *
 *   Copyright (C) 2024 by Daniele Cattaneo                                *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   As a special exception, if other files instantiate templates or use   *
 *   macros or inline functions from this file, or you compile this file   *
 *   and link it with other works to produce a work based on this file,    *
 *   this file does not by itself cause the resulting work to be covered   *
 *   by the GNU General Public License. However the source code for this   *
 *   file must still be made available in accordance with the GNU General  *
 *   Public License. This exception does not invalidate any other reasons  *
 *   why a work based on this file might be covered by the GNU General     *
 *   Public License.                                                       *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, see <http://www.gnu.org/licenses/>   *
 ***************************************************************************/ 

#include <cstring>
#include <errno.h>
#include <termios.h>
#include "stm32f2_f4_serial.h"
#include "kernel/sync.h"
#include "kernel/scheduler/scheduler.h"
#include "filesystem/ioctl.h"
#include "cache/cortexMx_cache.h"
#include "interfaces/gpio.h"

using namespace std;

//Work around ST renaming register fields for some STM32L4
#if defined(USART_CR1_RXNEIE_RXFNEIE) && !defined(USART_CR1_RXNEIE)
#define USART_CR1_RXNEIE    USART_CR1_RXNEIE_RXFNEIE
#endif
#if defined(USART_ISR_RXNE_RXFNE) && !defined(USART_ISR_RXNE)
#define USART_ISR_RXNE      USART_ISR_RXNE_RXFNE
#endif
#if defined(USART_ISR_TXE_TXFNF) && !defined(USART_ISR_TXE)
#define USART_ISR_TXE       USART_ISR_TXE_TXFNF
#endif

namespace miosix {

/*
 * Auxiliary class that encapsulates all parts of code that differ between
 * between each instance of this peripheral.
 * 
 * Try not to use the attributes of this class directly even if they are public,
 * in the current implementation they are not the best use of ROM space and
 * by using getter/setters we make it easier for ourselves to compress this
 * data structure a bit in the future.
 * TODO: Remove redundant information in the attributes
 */
class STM32SerialHW
{
public:
    enum Bus { APB1, APB2, AHB1, AHB2 };
    enum DmaIntRegShift
    {
        Stream0= 0, Stream1= 0+6, Stream2=16, Stream3=16+6,
        Stream4=32, Stream5=32+6, Stream6=48, Stream7=48+6
    };
    
    inline USART_TypeDef *get() const { return port; }
    inline IRQn_Type getIRQn() const { return irq; }
    inline unsigned char getAltFunc() const { return altFunc; }
    inline unsigned int IRQgetClock() const
    {
        unsigned int freq=SystemCoreClock;
        switch(bus)
        {
            case APB1:
                if(RCC->CFGR & RCC_CFGR_PPRE1_2)
                    freq/=1<<(((RCC->CFGR>>RCC_CFGR_PPRE1_Pos) & 0x3)+1);
                break;
            case APB2:
                if(RCC->CFGR & RCC_CFGR_PPRE2_2)
                    freq/=1<<(((RCC->CFGR>>RCC_CFGR_PPRE2_Pos) & 0x3)+1);
                break;
            default:
                break;
        }
        return freq;
    }
    inline void IRQenable() const { IRQgenericEn(bus, clkEnMask); }
    inline void IRQdisable() const { IRQgenericDis(bus, clkEnMask); }

    inline DMA_TypeDef *getDma() const { return dma; }
    inline void IRQdmaEnable() const { IRQgenericEn(dmaBus, dmaClkEnMask); }
    inline void IRQdmaDisable() const { IRQgenericDis(dmaBus, dmaClkEnMask); }

    inline DMA_Stream_TypeDef *getDmaTx() const { return dmaTx; }
    inline IRQn_Type getDmaTxIRQn() const { return dmaTxIrq; }
    inline unsigned long getDmaTxChannel() const { return dmaTxChannel; }
    inline unsigned long getDmaTxISR() const { return getDmaISR(dmaTxIRShift); }
    inline void setDmaTxIFCR(unsigned long v) const { return setDmaIFCR(dmaTxIRShift, v); }

    inline DMA_Stream_TypeDef *getDmaRx() const { return dmaRx; }
    inline IRQn_Type getDmaRxIRQn() const { return dmaRxIrq; }
    inline unsigned long getDmaRxChannel() const { return dmaRxChannel; }
    inline unsigned long getDmaRxISR() const { return getDmaISR(dmaRxIRShift); }
    inline void setDmaRxIFCR(unsigned long v) const { return setDmaIFCR(dmaRxIRShift, v); }

    USART_TypeDef *port;        ///< USART port
    IRQn_Type irq;              ///< USART IRQ number
    unsigned char altFunc;      ///< Alternate function to set for GPIOs
    STM32SerialHW::Bus bus;     ///< Bus where the port is (APB1 or 2)
    unsigned long clkEnMask;    ///< USART clock enable

    DMA_TypeDef *dma;           ///< Pointer to the DMA peripheral (DMA1/2)
    STM32SerialHW::Bus dmaBus;  ///< Bus where the DMA port is (AHB1 or 2)
    unsigned long dmaClkEnMask; ///< DMA clock enable bit

    DMA_Stream_TypeDef *dmaTx;  ///< Pointer to DMA TX stream
    IRQn_Type dmaTxIrq;         ///< DMA TX stream IRQ number
    unsigned char dmaTxIRShift; ///< Value from DMAIntRegShift for the stream
    unsigned char dmaTxChannel; ///< DMA TX stream channel

    DMA_Stream_TypeDef *dmaRx;  ///< Pointer to DMA RX stream
    IRQn_Type dmaRxIrq;         ///< DMA RX stream IRQ number
    unsigned char dmaRxIRShift; ///< Value from DMAIntRegShift for the stream
    unsigned char dmaRxChannel; ///< DMA TX stream channel

