skyward-er/miosix-kernel/miosix/arch/common/drivers/stm32f2_f4_serial.cpp
STM32DMASerial::STM32DMASerial(int id, int baudrate, GpioPin tx, GpioPin rx,
            GpioPin rts, GpioPin cts)
    : STM32SerialBase(id,baudrate,true), Device(Device::TTY)
{
    commonInit(id,baudrate,tx,rx,rts,cts);
}

void STM32DMASerial::commonInit(int id, int baudrate, GpioPin tx, GpioPin rx,
                    GpioPin rts, GpioPin cts)
{
    //Check if DMA is supported for this port
    if(!port->getDma()) errorHandler(UNEXPECTED);
    InterruptDisableLock dLock;

    port->IRQdmaEnable();
    IRQregisterIrq(port->getDmaTxIRQn(),&STM32DMASerial::IRQhandleDmaTxInterrupt,this);
    NVIC_SetPriority(port->getDmaTxIRQn(),15);
    NVIC_EnableIRQ(port->getDmaTxIRQn());
    //Higher priority to ensure IRQhandleDmaRxInterrupt() is called before
    //IRQhandleInterrupt(), so that idle is set correctly
    IRQregisterIrq(port->getDmaRxIRQn(),&STM32DMASerial::IRQhandleDmaRxInterrupt,this);
    NVIC_SetPriority(port->getDmaRxIRQn(),14);
    NVIC_EnableIRQ(port->getDmaRxIRQn());

    port->IRQenable();
    IRQregisterIrq(port->getIRQn(),&STM32DMASerial::IRQhandleInterrupt,this);
    NVIC_SetPriority(port->getIRQn(),15);//Lowest priority for serial
    NVIC_EnableIRQ(port->getIRQn());

    STM32SerialBase::commonInit(id,baudrate,tx,rx,rts,cts);

    port->get()->CR3 = USART_CR3_DMAT | USART_CR3_DMAR; //Enable USART DMA
    port->get()->CR1 = USART_CR1_UE     //Enable port
                       | USART_CR1_IDLEIE //Interrupt on idle line
                       | USART_CR1_TE     //Transmission enbled
                       | USART_CR1_RE;    //Reception enabled
    IRQstartDmaRead();
}

ssize_t STM32DMASerial::writeBlock(const void *buffer, size_t size, off_t where)
{
    Lock<FastMutex> l(txMutex);
    DeepSleepLock dpLock;
    const char *buf=reinterpret_cast<const char*>(buffer);
    size_t remaining=size;
    //If the client-provided buffer is not in CCM, we can use it directly
    //as DMA source memory (zero copy).
    if(isInCCMarea(buf)==false) 
    {
        //We don't use zero copy for the last txBufferSize bytes because in this
        //way we can return from this function a bit earlier.
        //If we returned while the DMA was still reading from the client
        //buffer, and the buffer is immediately rewritten, shit happens
        while(remaining>txBufferSize)
        {
            //DMA is limited to 64K
            size_t transferSize=min<size_t>(remaining-txBufferSize,65535);
            waitDmaWriteEnd();
            startDmaWrite(buf,transferSize);
            buf+=transferSize;
            remaining-=transferSize;
        }
    }
    //DMA out all remaining data through txBuffer
    while(remaining>0)
    {
        size_t transferSize=min(remaining,static_cast<size_t>(txBufferSize));
        waitDmaWriteEnd();
        //Copy to txBuffer only after DMA xfer completed, as the previous
        //xfer may be using the same buffer
        memcpy(txBuffer,buf,transferSize);
        startDmaWrite(txBuffer,transferSize);
        buf+=transferSize;
        remaining-=transferSize;
    }
    #ifdef WITH_DEEP_SLEEP
    //The serial driver by default can return even though the last part of
    //the data is still being transmitted by the DMA. When using deep sleep
    //however the DMA operation needs to be fully enclosed by a deep sleep
    //lock to prevent the scheduler from stopping peripheral clocks.
    waitDmaWriteEnd();
    waitSerialTxFifoEmpty(); //TODO: optimize by doing it only when entering deep sleep
    #endif //WITH_DEEP_SLEEP
    return size;
}

void STM32DMASerial::startDmaWrite(const char *buffer, size_t size)
{
    markBufferBeforeDmaWrite(buffer,size);
    DeepSleepLock dpLock;
    //The TC (Transfer Complete) bit in the Status Register (SR) of the serial
    //port can be reset by writing to it directly, or by first reading it
    //out and then writing to the Data Register (DR).
    //  The waitSerialTxFifoEmpty() function relies on the status of TC to
    //accurately reflect whether the serial port is pushing out bytes or not,
    //so it is extremely important for TC to *only* be reset at the beginning of
    //a transmission.
    //  Since the DMA peripheral only writes to DR and never reads from SR,
    //we must read from SR manually first to ensure TC is cleared as soon as
    //the DMA writes to it -- and not earlier!
    //  The alternative is to zero out TC by hand, but if we do that TC becomes
    //unreliable as a flag. Consider the case in which we are clearing out TC
    //in this routine before configuring the DMA. If the DMA fails to start due
    //to an error, or the CPU is reset before the DMA transfer is started, the
    //USART won't be pushing out bytes but TC will still be zero. As a result,
    //waitSerialTxFifoEmpty() will loop forever waiting for the end of a
    //transfer that is not happening.
    while((port->get()->SR & USART_SR_TXE)==0) ;
    
    dmaTxInProgress=true;
    port->getDmaTx()->PAR=reinterpret_cast<unsigned int>(&port->get()->DR);
    port->getDmaTx()->M0AR=reinterpret_cast<unsigned int>(buffer);
    port->getDmaTx()->NDTR=size;
    //Quirk: not enabling DMA_SxFCR_FEIE because at the beginning of a transfer
    //there is always at least one spurious fifo error due to the fact that the
    //FIFO doesn't begin to fill up until after the DMA request is triggered.
    //  This is just a FIFO underrun error and as such it is resolved
    //automatically by the DMA internal logic and does not stop the transfer,
    //just like for FIFO overruns.
    //  On the other hand, a FIFO error caused by register misconfiguration
    //would prevent the transfer from even starting, but the conditions for
    //FIFO misconfiguration are known in advance and we don't fall in any of
    //those cases.
    //  In other words, underrun, overrun and misconfiguration are the only FIFO
    //error conditions; misconfiguration is impossible, and we don't need to do
    //anything for overruns and underruns, so there is literally no reason to
    //enable FIFO error interrupts in the first place.
    port->getDmaTx()->FCR=DMA_SxFCR_DMDIS;//Enable fifo
    port->getDmaTx()->CR =
                (port->getDmaTxChannel() << DMA_SxCR_CHSEL_Pos) //Select channel
              | DMA_SxCR_MINC    //Increment RAM pointer
              | DMA_SxCR_DIR_0   //Memory to peripheral
              | DMA_SxCR_TCIE    //Interrupt on completion
              | DMA_SxCR_TEIE    //Interrupt on transfer error
              | DMA_SxCR_DMEIE   //Interrupt on direct mode error
              | DMA_SxCR_EN;     //Start the DMA
}

