skyward-er/miosix-kernel/miosix/arch/common/drivers/stm32f2_f4_serial.cpp
void STM32DMASerial::IRQhandleDmaTxInterrupt()
{
    port->setDmaTxIFCR(
          DMA_LIFCR_CTCIF0
        | DMA_LIFCR_CTEIF0
        | DMA_LIFCR_CDMEIF0
        | DMA_LIFCR_CFEIF0);
    dmaTxInProgress=false;
    if(txWaiting==nullptr) return;
    txWaiting->IRQwakeup();
    if(txWaiting->IRQgetPriority()>Thread::IRQgetCurrentThread()->IRQgetPriority())
        IRQinvokeScheduler();
    txWaiting=nullptr;
}

void STM32DMASerial::waitDmaWriteEnd()
{
    FastInterruptDisableLock dLock;
    // If a previous DMA xfer is in progress, wait
    if(dmaTxInProgress)
    {
        txWaiting=Thread::IRQgetCurrentThread();
        do {
            Thread::IRQwait();
            {
                FastInterruptEnableLock eLock(dLock);
                Thread::yield();
            }
        } while(txWaiting);
    }
}

ssize_t STM32DMASerial::readBlock(void *buffer, size_t size, off_t where)
{
    return STM32SerialBase::readFromRxQueue(buffer, size);
}

void STM32DMASerial::IRQstartDmaRead()
{
    port->getDmaRx()->PAR=reinterpret_cast<unsigned int>(&port->get()->DR);
    port->getDmaRx()->M0AR=reinterpret_cast<unsigned int>(rxBuffer);
    port->getDmaRx()->NDTR=rxQueueMin;
    port->getDmaRx()->CR = 
                (port->getDmaRxChannel() << DMA_SxCR_CHSEL_Pos) //Select channel
              | DMA_SxCR_MINC    //Increment RAM pointer
              | 0                //Peripheral to memory
              | DMA_SxCR_HTIE    //Interrupt on half transfer
              | DMA_SxCR_TEIE    //Interrupt on transfer error
              | DMA_SxCR_DMEIE   //Interrupt on direct mode error
              | DMA_SxCR_EN;     //Start the DMA
}

int STM32DMASerial::IRQstopDmaRead()
{
    //Stop DMA and wait for it to actually stop
    port->getDmaRx()->CR &= ~DMA_SxCR_EN;
    while(port->getDmaRx()->CR & DMA_SxCR_EN) ;
    port->setDmaRxIFCR(
          DMA_LIFCR_CTCIF0
        | DMA_LIFCR_CHTIF0
        | DMA_LIFCR_CTEIF0
        | DMA_LIFCR_CDMEIF0
        | DMA_LIFCR_CFEIF0);
    return rxQueueMin - port->getDmaRx()->NDTR;
}

void STM32DMASerial::IRQflushDmaReadBuffer()
{
    int elem=IRQstopDmaRead();
    markBufferAfterDmaRead(rxBuffer,rxQueueMin);
    for(int i=0;i<elem;i++)
        if(rxQueue.tryPut(rxBuffer[i])==false) /*fifo overflow*/;
    IRQstartDmaRead();
}

void STM32DMASerial::IRQhandleDmaRxInterrupt()
{
    IRQflushDmaReadBuffer();
    rxUpdateIdle(0);
    rxWakeup();
}

void STM32DMASerial::IRQhandleInterrupt()
{
    unsigned int status=port->get()->SR;
    rxUpdateIdle(status);
    if(status & USART_SR_IDLE)
    {
        (unsigned long)port->get()->DR; //clears interrupt flags
        IRQflushDmaReadBuffer();
    }
    if((status & USART_SR_IDLE) || rxQueue.size()>=rxQueueMin)
    {
        //Enough data in buffer or idle line, awake thread
        rxWakeup();
    }
}

void STM32DMASerial::IRQwrite(const char *str)
{
    //We can reach here also with only kernel paused, so make sure
    //interrupts are disabled
    bool interrupts=areInterruptsEnabled();
    if(interrupts) fastDisableInterrupts();
    //Wait until DMA xfer ends. EN bit is cleared by hardware on transfer end
    while(port->getDmaTx()->CR & DMA_SxCR_EN) ;
    STM32SerialBase::IRQwrite(str);
    if(interrupts) fastEnableInterrupts();
}

STM32DMASerial::~STM32DMASerial()
{
    waitSerialTxFifoEmpty();
    {
        InterruptDisableLock dLock;
        port->get()->CR1=0;
        IRQstopDmaRead();
        NVIC_DisableIRQ(port->getDmaTxIRQn());
        NVIC_ClearPendingIRQ(port->getDmaTxIRQn());
        IRQunregisterIrq(port->getDmaTxIRQn());
        NVIC_DisableIRQ(port->getDmaRxIRQn());
        NVIC_ClearPendingIRQ(port->getDmaRxIRQn());
        IRQunregisterIrq(port->getDmaRxIRQn());
        NVIC_DisableIRQ(port->getIRQn());
        NVIC_ClearPendingIRQ(port->getIRQn());
        IRQunregisterIrq(port->getIRQn());
        port->IRQdisable();
    }
}

} //namespace miosix
